src/InformationRegisters/МенеджерыТорговыхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>МенеджерыТорговыхТочек</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидМенеджера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМенеджеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыМенеджеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыМенеджеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Снабжения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамМенеджераСнабжения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамМенеджераПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлючевыхКлиентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/МенеджерыТорговыхТочек/Ext/ManagerModule.bsl
Функция МенеджерКлиента(Контрагент,ВидМенеджера,Период = Неопределено) Экспорт
	лКлючАлгоритма = "РегистрСыедений_МенеджерыТорговыхТочек_МенеджерКлиента";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////
	
	Запрос=Новый Запрос;
	ЗАПРОС.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	МенеджерыТорговыхТочекСрезПоследних.Менеджер
	|ИЗ
	|	РегистрСведений.МенеджерыТорговыхТочек.СрезПоследних(&Период, ) КАК МенеджерыТорговыхТочекСрезПоследних
	|ГДЕ
	|	МенеджерыТорговыхТочекСрезПоследних.Контрагент = &Контрагент
	|	И НЕ МенеджерыТорговыхТочекСрезПоследних.Менеджер = ЗНАЧЕНИЕ(Справочник.Менеджеры.Пустаяссылка)
	|	И МенеджерыТорговыхТочекСрезПоследних.ВидМенеджера = &ВидМенеджера";
	Запрос.УстановитьПараметр("Контрагент",Контрагент.Ссылка);
	Запрос.УстановитьПараметр("ВидМенеджера",Перечисления.ВидыМенеджеров.Продажи);
	Запрос.УстановитьПараметр("Период",?(Период = Неопределено,ТекущаяДата(),Период));
	Результат=Запрос.Выполнить();
	Если Результат.Пустой() тогда 
		возврат  Справочники.Менеджеры.ПустаяСсылка();
	иначе 
		Выборка  = Результат.Выбрать();
		Выборка.Следующий();
		Возврат выборка.Менеджер ;
	КонецЕсли;	
	
		
КонецФункции
